Revit 2026 API

# TessellatedShapeBuilderCreateMeshByExtrusion Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static MeshFromGeometryOperationResult CreateMeshByExtrusion(
	IList<CurveLoop> profileLoops,
	XYZ extrusionDirection,
	double extrusionDistance,
	ElementId materialId
)
```
```vb
Public Shared Function CreateMeshByExtrusion (
	profileLoops As IList(Of CurveLoop),
	extrusionDirection As XYZ,
	extrusionDistance As Double,
	materialId As ElementId
) As MeshFromGeometryOperationResult
```
```cpp
public:
static MeshFromGeometryOperationResult^ CreateMeshByExtrusion(
	IList<CurveLoop^>^ profileLoops,
	XYZ^ extrusionDirection,
	double extrusionDistance,
	ElementId^ materialId
)
```
```fsharp
static member CreateMeshByExtrusion :
        profileLoops : IList<CurveLoop> *
        extrusionDirection : XYZ *
        extrusionDistance : float *
        materialId : ElementId -> MeshFromGeometryOperationResult
```

#### Parameters

profileLoops IListCurveLoop

extrusionDirection XYZ

extrusionDistance Double

materialId ElementId

#### Return Value

MeshFromGeometryOperationResult

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace